<?php
//
error_reporting(-1);
header('Content-Type: text/html; charset=utf-8');
////$arr = ['a'=>1, 'b'=>2, 'c'=>3, 'd'=>4, 'e'=>5];








//$arr = [10, 20, 15, 17, 24, 35];
//
//$result = 0;
//foreach ($arr as $elem) {
//	$result += $elem;
//}
//echo $result; //выведем сумму на экран



//	$arr = [1, 2, 3, 4, 5];
//	$result = 0;
//	foreach ($arr as $elem) {
//$result += $elem * $elem .'<br/>';
//
//	}
//	echo $result;


//$arr = ['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'];
//$arr = ['Коля'=>'200', 'Вася'=>'300','Петя'=>'400'];
//foreach ($arr as $key=>$elem) {
//	echo	$result = $key .' Зарплата - '. $elem .' - долларов.'.'<br/>';
//
//}
//
//$var = 100;
//
//for($i=0;$i=15; $i++ ){
////	 $i);
//	echo $i.'<br>';
//
//}

//$i = 1; //начальное значение переменной $i
//while ($i <= 100) { //цикл закончится, когда $i станет больше 5-ти
//	/*
//		Выводим значение переменной $i на экран
//		при каждом проходе цикла:
//	*/
//	echo $i.'<br>';
//
//	/*
//		С помощью оператора ++ увеличиваем $i на единицу
//		при каждом проходе цикла:
//	*/
//	$i++;
//}
//$result =0;
//
//for ($i = 1; $i <=100; $i++) //<--- точка с запятой есть
// $rusult += $i.'<br>'; //выведет 9
//
//echo $rusult; // выведет 5050

//$result =0;
//
//$i = 1; //начальное значение переменной $i
//while ($i <= 100) { //цикл закончится, когда $i станет больше 5-ти
//	/*
//		Выводим значение переменной $i на экран
//		при каждом проходе цикла:
//	*/
//	$result += $i.'<br>';
//
//	/*
//		С помощью оператора ++ увеличиваем $i на единицу
//		при каждом проходе цикла:
//	*/
//	$i++;
//}
//
//echo $result;


//$sum = 0;
//$i = 1;
//while ($i <= 100) {
//	$sum += $i;
//	$i++;
//}


//for ($i = 1; $i <=100 /2; $i++) //<--- точка с запятой есть
//	echo $i+ $i.'<br>'; //выведет 9

//echo $result; // выведет 5050

//$result =0;

//
//$sum = 0;
//$i = 1;
//while ($i <= 100 /2) {
//	if($i / 2) {
//		echo $i + $i . '<br>';
//	}
//
//
//
//	$i++;
//}

//
//	$i = 0;
//	while ($i <100) {
//		 $i.'<br>';
//		echo $i = $i + 2 .'<br>';
//	}
//




//	for ($i = 0; $i <= 100; $i += 2) {
//		echo $i.'<br>';
//	}


//
//	$sum = 0;
//	for ($i = 1; $i <= 100; $i++) {
//		$sum += $i;
//	}
//
//	echo $sum;



//
//for ($i = 2; $i <= 100; $i += 2) {
//	echo $i.'<br>';
//}



//$arr = [2, 5, 9, 15, 0, 4];
//sort($arr);
//
//foreach ($arr as $value){
//	if($value > 3 and $value < 10 ){
//		echo $value.'<br>';
//	}
////	echo $value. '<br>';
//}

//
//for ($i = 0; $i <= count($arr[]); $i++)
//{
//	echo $arr[$i].'<br>';
//}

//for ($i = 0, $j = 10; $i <50;  $i = $i + $j) {
//	echo $j++.'<br>';
//	echo $i++.'='. $i.'<br>';
//	//echo $i .'+'. $j.'<br>' ;
//
////
////}
//$arr = [2, 5, 9, 15, 0, 4];
//
//foreach ($arr as $v){
//	if($v==4){
//		echo $v .PHP_EOL.'\n есть';
//		break;
//	}
//}

//$r=0;
//$arr = [2, 5, -9, -15, 0, 4];
//foreach ($arr as $elem) {
//	if ( $elem > 0) {
//		echo $elem.'<br>';
//		$r+=$elem;
//	}
//
//}


//$arr = ['10', '20', '30', '50', '235', '3000'];


//for()


//	$r=0;
//$arr = [2, 5, -9, -15, 0, 4];
//foreach ($arr as $elem) {
//	if ( $elem > 0) {
//		echo $elem.'<br>';
//		$r+=$elem;
//	}


//$arr = [1=>'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
//	foreach ($arr as $elem=>$v) {
//		echo $v;
//	if ($arr[7]or $arr[6]) {
//						echo '<b>'.$arr[6].'<b/>'.'<br>';
//			echo '<b>'.$arr[7].'<b/>'.'<br>';
//			break;
//
//	}else {
//		echo $elem.'<br>';
//	}
//	}

//$day='чт';
//
//$arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
//foreach ($arr as $elem) {
//	if ($elem == $day ) {
//		echo '<i>'.$elem.'</i><br>';
//	} else {
//		echo $elem.'<br>';
//	}
//}

//for($i=1;$i<=100; $i++){
//
//	 $arr[] = $i;
//}
//
//
//
//var_dump($arr);
//$arr = ['green'=>'зеленый', 'red'=>'красный', 'blue'=>'голубой'];
//
//foreach ( $arr as $g=>$v ) {
////	echo $g.PHP_EOL;
//	$en[] = $g;
//	$ru[] = $v;
//}
//
//var_dump( $en );
//var_dump( $ru );
//
//
//$num=1000;

//while(1000 /2){
//
//		echo  'есть';
//
//
//
//}

//
//for($i=50;$i<=1000/2;$i++){
//
//		echo $i;
//
//
//}

//for ($i = 0, $j=50; $i <=1000; $i++, $i=$i+$j) {
//
//	echo $i .'<br>'; //выведет 0, 1, 2... 9
//
//}
////500
////250
////125
////75
////35


//$num = 100;
//$i=0;
//while ($num > 50) {
//	echo 'перед делением';
//	echo $num;
//	echo 'перед делением';
//	echo '<br>';
//	echo $num = $num / 2;
//	echo '<br>';
//	echo 'после деления';
//	echo $num;
//	echo 'после деления';
//	$i++;
//	echo '--';
//	echo $i;
//	echo '--';
//	echo '<br>';
//}

//echo $i.'<br>'; //кол-во итераций
//echo $num; //число, которое получилось
//$num = 1000;
//for ($i = 0; $num < 50; ){
//
//$num /= 2;
//	$i++;
//}
//echo $i.'<br>'; //кол-во итераций
//echo $num; //число, которое получилось

echo PHP_EOL;
echo mt_getrandmax();

//echo getrand(35000, 50000);


$num = 1000;
$i = 0;
while ($num > 50) {
	$num /= 2;
	$i++;
}

echo $i.'<br>'; //кол-во итераций
echo $num; //число, которое получилось
?>